{
  "backend/main.mo": "Main canister logic defining comments, rating images, messages, device‑scoped user history, access control, and bulk generator key management with storage mixins.",
  "backend/migration.mo": "Migration module converting old single-level user comment history into new per-device nested history format.",
  "feature_evidence.json": "Feature evidence report listing implemented device‑scoped history features, related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten short summaries for various frontend source files.",
  "frontend/index.css": "Global Tailwind-based style sheet defining OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application managing view modes, admin PIN unlock, layout, and global UI providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component showing an access-denied card for unauthorized admin panel access.",
  "frontend/src/components/AccessKeyDialog.tsx": "Modal prompting users for the bulk generator access key with validation and loading states.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat interface that loads, displays, sorts, and replies to user messages with unread indicators and auto-scrolling.",
  "frontend/src/components/AdminDetailsCard.tsx": "Static card showing admin profile details such as name, contact, progression, and payment time.",
  "frontend/src/components/AdminPinDialog.tsx": "Dialog for validating a 4-digit admin access code with input handling, error states, and success callbacks.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based animated background rendering moving particles and floating icons with color effects.",
  "frontend/src/components/BulkGeneratorKeyManager.tsx": "UI for viewing, setting, and resetting the bulk generator access key with masked display and confirmation dialogs.",
  "frontend/src/components/ChatBox.tsx": "User chat widget that toggles open, displays messages, handles sending, and syncs with authentication state.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding, credits, and production version info.",
  "frontend/src/components/Header.tsx": "Header component showing app title, theme toggle, and logout handling tied to Internet Identity and React Query.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, initializing admin access and invalidating dependent queries on change.",
  "frontend/src/hooks/useDeviceId.ts": "Provides a stable device ID loaded from localStorage via getDeviceId.",
  "frontend/src/hooks/useDeviceScopedGenerateComment.ts": "Mutation hook generating a comment scoped to a device, updating local history and invalidating relevant queries.",
  "frontend/src/hooks/useDeviceScopedUserCommentHistory.ts": "Fetches device-scoped comment history with backend reconciliation and localStorage seeding for offline behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, login/clear functions, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for admin checks, comment lists, counts, bulk generation, and key management.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme variables and custom gradient, glow, and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPanel.tsx": "Admin interface for managing comment lists, adding comments (single or bulk), handling rating images, and viewing bulk statistics.",
  "frontend/src/pages/UploadSection.tsx": "UI for users to upload images, add comments, and generate bulk comments with access-key validation.",
  "frontend/src/pages/UserView.tsx": "End‑user view for generating single or bulk comments, checking remaining counts, uploading images, and viewing device-scoped history.",
  "frontend/src/utils/adminPinSession.ts": "Exports the static admin access code used for backend‑compatible admin operations.",
  "frontend/src/utils/deviceHistoryStorage.ts": "Utilities for loading, saving, updating, and clearing device‑scoped comment generation history in localStorage.",
  "frontend/src/utils/deviceId.ts": "Generates, retrieves, and clears a persistent per-device identifier stored in localStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash‑based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and theme utilities for the frontend.",
  "project_state.json": "Defines the project’s overall state, including versioning, architectural notes of the ICP backend and React frontend, and known issues with comment randomness, validation gaps, and deployment inconsistencies."
}