{
  "backend/main.mo": "Actor canister implementing comment lists, rating images, messages, user profiles, payments, auth, locking, sessions, and bulk generation key management.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for reference or documentation.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background and text rules.",
  "frontend/index.html": "Base HTML template bootstrapping the React app with an error fallback and environment shim.",
  "frontend/src/App.tsx": "Main app component handling tab navigation, admin PIN unlock flow, and rendering customer, upload, and admin views.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card displaying an access‑denied message for unauthorized users trying to access the admin panel.",
  "frontend/src/components/AccessKeyDialog.tsx": "A dialog component that prompts users for an access key using a password input and handles submission, cancellation, and loading states.",
  "frontend/src/components/AdminChatPanel.tsx": "Displays a scrollable admin chat interface with sorted user messages, unread counts, and reply functionality.",
  "frontend/src/components/AdminDetailsCard.tsx": "Shows static administrator details in a styled card layout.",
  "frontend/src/components/AdminPinDialog.tsx": "A PIN entry dialog that validates a 4‑digit admin access code with error handling and success callbacks.",
  "frontend/src/components/AdminUserImageTable.tsx": "Provides UI for uploading, listing, and removing user rating images with bulk upload progress tracking and error handling.",
  "frontend/src/components/AnimatedBackground.tsx": "Renders an animated canvas background with drifting particles and rotating geometric icons, adapting to visibility and motion preferences.",
  "frontend/src/components/auth/AuthGuard.tsx": "Empty file placeholder for authentication guard component.",
  "frontend/src/components/BulkGeneratorKeyManager.tsx": "UI for viewing, setting, and resetting the bulk generator access key with dialogs and status indicators.",
  "frontend/src/components/ChatBox.tsx": "Unused placeholder component that currently renders nothing.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays an error screen and allows reloading or retrying.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution, branding, and production version info.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, branding, and admin-unlock indicators including logout controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useDeviceId.ts": "Hook returning a stable device ID stored in localStorage.",
  "frontend/src/hooks/useDeviceScopedGenerateComment.ts": "Empty file placeholder for device-scoped comment generation hook.",
  "frontend/src/hooks/useDeviceScopedUserCommentHistory.ts": "Empty file placeholder for device-scoped user comment history hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useMidnightCommentListClear.ts": "Hook that auto‑clears comment lists after midnight and invalidates related queries.",
  "frontend/src/hooks/usePasswordAuth.tsx": "Empty file placeholder for password-based auth hook.",
  "frontend/src/hooks/useQueries.ts": "Collection of react‑query hooks wrapping backend actor calls for comment lists, comments, bulk totals, and mutations.",
  "frontend/src/index.css": "Sets Tailwind layers, theme color variables for light/dark modes, utility classes, and animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/account/ProfilePage.tsx": "Displays user profile details from localStorage using styled cards and icons.",
  "frontend/src/pages/AdminPanel.tsx": "Admin interface for managing comment lists, bulk comments, locks, and related admin tools.",
  "frontend/src/pages/auth/SignInPage.tsx": "Empty placeholder file for the sign‑in page.",
  "frontend/src/pages/auth/SignUpPage.tsx": "Empty placeholder file for the sign‑up page.",
  "frontend/src/pages/payments/PaymentsPage.tsx": "Shows a styled payment history view using mock data with status badges and scrollable transactions.",
  "frontend/src/pages/UploadSection.tsx": "Allows users to upload images, generate bulk comments, and copy generated content with list lock handling.",
  "frontend/src/pages/UserView.tsx": "User-facing page to upload rating images, generate bulk comments, and view remaining counts with lock checks.",
  "frontend/src/pages/wallet/WalletPage.tsx": "React page showing a styled wallet UI with a mock zero balance and informational text.",
  "frontend/src/utils/adminPinSession.ts": "Exports a constant admin access code for backend‑compatible admin operations.",
  "frontend/src/utils/deviceHistoryStorage.ts": "Provides localStorage helpers to load, save, update, and clear per-device comment history.",
  "frontend/src/utils/deviceId.ts": "Generates, stores, retrieves, and clears a persistent device ID using localStorage or a session-only fallback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and loading typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata describing current features, requirements, issues, and architectural notes for the app."
}