{
  "kind": "build_request",
  "title": "Restore public Customer View + Upload Section, keep admin-only unlock, add app lock/unlock + bulk image download, and improve UI/performance",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore a public (no PIN/no authentication) end-user experience with both a Customer View section and an Upload Section section available without admin unlock, matching the v46 structure as closely as possible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "But where is customer view section or upload section came it back and make same to same as in version 46 no need any pin code or authentication for others users except admin"
        ]
      },
      "acceptanceCriteria": [
        "When opening the app in a fresh session, users can access Customer View and Upload Section without being prompted for an admin PIN.",
        "Admin PIN gating remains required only for the Admin Panel area.",
        "Customer View page renders and functions (comment generation, history, bulk generation prompt) without admin unlock.",
        "Upload Section page renders and functions (upload comment, bulk generator prompt, upload rating image) without admin unlock."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the app shell/navigation so users can switch between Customer View, Upload Section, and Admin Panel; only Admin Panel must be protected by the existing admin PIN unlock flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "no need any pin code or authentication for others users except admin"
        ]
      },
      "acceptanceCriteria": [
        "There is a clear navigation control (tabs, header links, or similar) to access Customer View, Upload Section, and Admin Panel.",
        "Attempting to open Admin Panel while not unlocked shows the admin PIN dialog/lock screen.",
        "Customer View and Upload Section never show the admin PIN dialog."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement an admin-controlled lock/unlock state per existing “app” (treat as comment list IDs) so that when a list is locked, end users cannot generate comments from that list until it is unlocked.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Lock the existing app means when admin lock any app from admin section user can't able to generate comments through it until admin unlock it"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a locked/unlocked flag per comment list ID and persists it across reloads.",
        "Admin Panel includes controls to lock/unlock each list.",
        "When a list is locked, Customer View comment generation for that list is blocked and returns a clear error message.",
        "When a list is unlocked, normal comment generation resumes."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update Customer View and Upload Section UIs to reflect locked lists: indicate lock status in list selection UI and disable/guard generate actions for locked lists with an English explanation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "user can't able to generate comments through it until admin unlock it"
        ]
      },
      "acceptanceCriteria": [
        "Locked lists are visibly labeled (e.g., 'Locked') in the list selector and/or near the action buttons.",
        "Generate Comment and Bulk Generate actions cannot be executed for locked lists; the UI shows an English message explaining the list is locked by the admin.",
        "Unlocked lists behave as before."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add an Admin Panel action to download all uploaded rating images in one click.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also download the uploaded images in one click through the admin panel",
          "make easy to download all the images in one click only"
        ]
      },
      "acceptanceCriteria": [
        "Admin Panel provides a single button/action labeled in English to download all uploaded images.",
        "Clicking the action results in a single download artifact for the admin (e.g., a ZIP) or a single action that triggers a complete bulk download flow without requiring per-image clicks.",
        "The download includes all stored uploaded rating images with stable filenames that include at least the associated userName and an index or unique ID.",
        "The action provides loading/progress feedback and a success/failure toast/message."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Improve perceived performance and fix slowness/lag in the UI, focusing on reducing unnecessary re-renders and expensive visual effects while keeping the interface visually appealing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Sometimes website runs late"
        ]
      },
      "acceptanceCriteria": [
        "Customer View and Upload Section initial render completes without long blocking spinners under normal conditions.",
        "Animations/background effects do not noticeably degrade responsiveness on typical devices (e.g., scrolling, opening dialogs, switching tabs).",
        "React Query usage avoids redundant refetch loops and heavy work on every render for the main pages."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Improve the overall UI colors/graphics with a coherent visual theme applied consistently across Customer View, Upload Section, and Admin Panel (English UI text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Improve the graphics or colours also on it"
        ]
      },
      "acceptanceCriteria": [
        "A single cohesive theme (colors, gradients, shadows, typography, spacing) is applied across all major pages.",
        "Contrast and readability are improved in both light and dark modes.",
        "Visual polish updates do not remove required functionality."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if existing stable state requires migration.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers or any login flow for non-admin users.",
    "Introducing external databases or non-Internet-Computer backend services.",
    "Building real-time features (WebSockets/chat real-time updates beyond existing polling/query refresh patterns)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}